soa4-reqs/countByHealth.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="https://localhost:8080/api/v1/space-marines">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:countByHealthRequest>
        <gs:health>1</gs:health>
      </gs:countByHealthRequest>
   </soapenv:Body>
</soapenv:Envelope>

